app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-09-16 00:11:02.567780"], ["updated_at", "2018-09-16 00:11:02.567780"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-09-16 00:11:02.572575"], ["updated_at", "2018-09-16 00:11:02.572575"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    binding.pry
    CSV.foreach(params[:path], headers: true) do |song|
      artist = Artist.find_or_create_by(:name => song[1])